blog/2020-12-31/Adding-FFI-Support-In-x7.org
# -*- find-file-hook: make-blogging-mode -*-
#+AUTHOR: David Briggs
#+TITLE: Adding FFI Support in x7
#+OPTIONS: html-style:nil num:nil ^:nil
<2020-12-31 Thu>
#+ATTR_HTML: target="_blank"


* Adding FFI Support in x7

FFI, or Foreign Function Interface, is mechanism whereby different programming languages can interact with each other in a direct way. [[https://github.com/dpbriggs/x7][x7]] is a lisp I made to explore language design and interpreters. Here's the hello world for it:

#+begin_src lisp
(println "Hello World!")
#+end_src

I want other rust programs to be able to *conveniently* embed a x7 interpreter, pass data back
and forth, and have x7 call foreign functions. Here's a TLDR example:

#+begin_src rust
  // Some necessary imports
  use x7::ffi::{ForeignData, IntoX7Function, X7Interpreter};

  // A foreign function we want to add to x7.
  // Note: It's typed in u32, which x7 does _not_ understand.
  fn my_foreign_function(a: u32, b: u32) -> u32 {
      a + b
  }

  fn main() {
      // Make an interpreter instance.
      let interpreter = X7Interpreter::new();
      // Add my function to the interpreter
      interpreter.add_function("my-ff", my_foreign_function.to_x7_fn());
      // Run an x7 program using my function
      let res: u32 = interpreter.run_program("(my-ff 1 2)").unwrap();
      // Verify the results
      assert_eq!(res, 3);
  }

#+end_src

This blog post will detail the inner workings of making FFI convenient in x7.

** An Overview of x7's internal structure

To better understand how x7's FFI system works, we'll need to quickly cover how x7 represents
types internally. All types, from numbers to lists to functions are instances of the =Expr= enum:

#+begin_src rust
  pub enum Expr {
      Num(Num),
      String(String),
      Symbol(Symbol),
      List(Vector<Expr>),
      Function(Function),
      Nil,
      // ... some elided variants
  }
#+end_src

Fundamental to the FFI system is being able to convert foreign data types like =u64= to a sensible
=Expr= variant like =Expr::Num=. x7 _only_ understands =Expr=, and it's impossible to use any other type.
Throughout this article I will refer to non-Expr types as foreign, as they really are.

The next fundamental concern is converting foreign functions to x7's =Function= struct. The
struct contains a few useful things, like the actual function pointer that actually does the work,
and some auxiliary information like minimum number of arguments and whether to evaluate arguments or not.

In subsequent sections of the article we'll cover the rust traits responsible for the conversion.

** Motivating Example

My original motivation was embedding x7 as a scripting language in the database =redis-oxide=.

In particular, I wanted this to be possible:

#+begin_src lisp
  ;; basic x7 program, running inside of redis-oxide
  (+ "redis-oxide returned: "
     (redis "get" "mykey"))
#+end_src

That =redis= function is foreign, so as alluded to in the FFI example above, it operates
on it's own foreign types. This implies that x7's FFI system will need to transparently and automatically convert between foreign types and it's own native type =Expr=.

An implementation detail of the =redis-oxide= database is that it operates internally
on the =RedisRefValue= type. So concretely we need a way to convert ="get"= and ="mykey"= into a
=RedisRefValue=. On the other end, =redis-oxide= returns the same type after an operation,
so we need to convert that to something =x7= understands (=Expr=), so it can operate on that.

** What should x7's FFI interface support?

At a minimum we need to support:

1. A nice way to transparently operate on foreign data types.
2. Foreign functions being typed in their native types, not x7's =Expr=.
   1. If you've worked with other FFI systems, like Python's excellent [[https://docs.python.org/3/extending/extending.html][FFI system]],
      functions added to the interpreter are typed in _Python's_ types, not the types of your program. This is fine, but not convenient as you need to manually convert python to your types and back.
3. A nice way to construct and add these functions to the interpreter.

