blog/2020-12-31/Adding-FFI-Support-In-x7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-01 Fri 17:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Adding FFI Support in x7</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Briggs" />
</head>
<body>
<div id="content">
<h1 class="title">Adding FFI Support in x7</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga64ec5c">Adding FFI Support in x7</a>
<ul>
<li><a href="#org1b01cf1">An Overview of x7's internal structure</a></li>
<li><a href="#orgc23928f">Motivating Example</a></li>
<li><a href="#orgaba6b30">What should x7's FFI interface support?</a></li>
<li><a href="#org45078a5">Reasoning about Foreign Data</a>
<ul>
<li><a href="#org379091f">Example implementation of ForeignData</a></li>
</ul>
</li>
<li><a href="#orgef9a258">Implementing ForeignData for common types</a></li>
<li><a href="#orgfabb7a6">Foreign Functions: The IntoX7Function Trait</a></li>
<li><a href="#org63ef521">The X7Interpreter</a></li>
<li><a href="#org72dbe0d">Conclusion</a></li>
<li><a href="#orgf5709db">Appendix: Variadics</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-12-31 Thu&gt;</span></span>
</p>


<div id="outline-container-orga64ec5c" class="outline-2">
<h2 id="orga64ec5c">Adding FFI Support in x7</h2>
<div class="outline-text-2" id="text-orga64ec5c">
<p>
FFI, or Foreign Function Interface, is mechanism whereby different programming languages can interact with each other in a direct way. <a href="https://github.com/dpbriggs/x7">x7</a> is a lisp I made to explore language design and interpreters. Here's the hello world for it:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>println <span style="color: #D9A0A0;">"Hello World!"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
I want other rust programs to be able to <b>conveniently</b> embed a x7 interpreter, pass data back
and forth, and have x7 call foreign functions. Here's a TLDR example:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Some necessary imports</span>
<span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #CCF8CC;">x7</span>::<span style="color: #CCF8CC;">ffi</span>::<span style="color: #DCDCCC;">{</span><span style="color: #89C5C8;">ForeignData</span>, <span style="color: #89C5C8;">IntoX7Function</span>, <span style="color: #89C5C8;">X7Interpreter</span><span style="color: #DCDCCC;">}</span>;

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">A foreign function we want to add to x7.</span>
<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Note: It's typed in u32, which x7 does _not_ understand.</span>
<span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">my_foreign_function</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">a</span>: <span style="color: #89C5C8;">u32</span>, <span style="color: #ECBC9C;">b</span>: <span style="color: #89C5C8;">u32</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">u32</span> <span style="color: #DCDCCC;">{</span>
    a + b
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Make an interpreter instance.</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">interpreter</span> = <span style="color: #89C5C8;">X7Interpreter</span>::new<span style="color: #CCF8CC;">()</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Add my function to the interpreter</span>
    interpreter.add_function<span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"my-ff"</span>, my_foreign_function.to_x7_fn<span style="color: #DDCC9C;">()</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Run an x7 program using my function</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">res</span>: <span style="color: #89C5C8;">u32</span> = interpreter.run_program<span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"(my-ff 1 2)"</span><span style="color: #CCF8CC;">)</span>.unwrap<span style="color: #CCF8CC;">()</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Verify the results</span>
    <span style="color: #9CC7FB;">assert_eq!</span><span style="color: #CCF8CC;">(</span>res, <span style="color: #CCF8CC;">3</span><span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>

</pre>
</div>

<p>
This blog post will detail the inner workings of making FFI convenient in x7.
</p>
</div>

<div id="outline-container-org1b01cf1" class="outline-3">
<h3 id="org1b01cf1">An Overview of x7's internal structure</h3>
<div class="outline-text-3" id="text-org1b01cf1">
<p>
To better understand how x7's FFI system works, we'll need to quickly cover how x7 represents
types internally. All types, from numbers to lists to functions are instances of the <code>Expr</code> enum:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">Expr</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Num</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Symbol</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">List</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Function</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Function</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Nil</span>,
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... some elided variants</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Fundamental to the FFI system is being able to convert foreign data types like <code>u64</code> to a sensible
<code>Expr</code> variant like <code>Expr::Num</code>. x7 <span class="underline">only</span> understands <code>Expr</code>, and it's impossible to use any other type.
Throughout this article I will refer to non-Expr types as foreign, as they really are.
</p>

<p>
The next fundamental concern is converting foreign functions to x7's <code>Function</code> struct. The
struct contains a few useful things, like the actual function pointer that actually does the work,
and some auxiliary information like minimum number of arguments and whether to evaluate arguments or not.
</p>

<p>
In subsequent sections of the article we'll cover the rust traits responsible for the conversion.
</p>
</div>
</div>

<div id="outline-container-orgc23928f" class="outline-3">
<h3 id="orgc23928f">Motivating Example</h3>
<div class="outline-text-3" id="text-orgc23928f">
<p>
My original motivation was embedding x7 as a scripting language in the database <code>redis-oxide</code>.
</p>

<p>
In particular, I wanted this to be possible:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">basic x7 program, running inside of redis-oxide</span>
<span style="color: #DCDCCC;">(</span>+ <span style="color: #D9A0A0;">"redis-oxide returned: "</span>
   <span style="color: #CCF8CC;">(</span>redis <span style="color: #D9A0A0;">"get"</span> <span style="color: #D9A0A0;">"mykey"</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
That <code>redis</code> function is foreign, so as alluded to in the FFI example above, it operates
on it's own foreign types. This implies that x7's FFI system will need to transparently and automatically convert between foreign types and it's own native type <code>Expr</code>.
</p>

<p>
An implementation detail of the <code>redis-oxide</code> database is that it operates internally
on the <code>RedisRefValue</code> type. So concretely we need a way to convert <code>"get"</code> and <code>"mykey"</code> into a
<code>RedisRefValue</code>. On the other end, <code>redis-oxide</code> returns the same type after an operation,
so we need to convert that to something <code>x7</code> understands (<code>Expr</code>), so it can operate on that.
</p>
</div>
</div>

<div id="outline-container-orgaba6b30" class="outline-3">
<h3 id="orgaba6b30">What should x7's FFI interface support?</h3>
<div class="outline-text-3" id="text-orgaba6b30">
<p>
At a minimum we need to support:
</p>

<ol class="org-ol">
<li>A nice way to transparently operate on foreign data types.</li>
<li>Foreign functions being typed in their native types, not x7's <code>Expr</code>.
<ol class="org-ol">
<li>If you've worked with other FFI systems, like Python's excellent <a href="https://docs.python.org/3/extending/extending.html">FFI system</a>,
functions added to the interpreter are typed in <span class="underline">Python's</span> types, not the types of your program. This is fine, but not convenient as you need to manually convert python to your types and back.</li>
</ol></li>
<li>A nice way to construct and add these functions to the interpreter.</li>
</ol>
</div>
</div>
