blog/2020-12-31/Adding-FFI-Support-In-x7.org
** Reasoning about Foreign Data

A fundamental concern of an FFI system is to reason about data passed between the foreign program and x7.
In x7's FFI system, this behaviour is captured in the =ForeignData= trait:

#+begin_src rust
pub trait ForeignData
where
    Self: Sized,
{
    /// Convert from Self to x7's Expr type.
    fn to_x7(&self) -> Result<Expr, Box<dyn Error + Send>>;
    /// Convert x7's Expr type to Self.
    fn from_x7(expr: &Expr) -> Result<Self, Box<dyn Error + Send>>;
}
#+end_src

This trait encodes a fallible forward-and-backward mapping between some foreign type and x7's =Expr= type.
If you're not familiar with =rust=, this adds methods to a type, and each operation
either results in a =Result=, which encodes a success path, and a failure path of type =Box<dyn Error + Send>=.

If the conversion fails for any reason, we try our best to type erase that error in terms
of =Box<dyn Error + Send>=. This error trait object helps a lot with wrangling different error types
into just one that we can reason about. That =Error= trait is the =std::error::Error= trait, which helps
interoperability between different rust programs. The =Send= trait bound is required as
our motivating example is =redis-oxide=, which requires that errors be sent between threads.
There's creates some unfortunate boilerplate around handling errors, but thankfully it's only around twenty lines.

