blog/2020-12-31/Adding-FFI-Support-In-x7.html

<div id="outline-container-org45078a5" class="outline-3">
<h3 id="org45078a5">Reasoning about Foreign Data</h3>
<div class="outline-text-3" id="text-org45078a5">
<p>
A fundamental concern of an FFI system is to reason about data passed between the foreign program and x7.
In x7's FFI system, this behaviour is captured in the <code>ForeignData</code> trait:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">ForeignData</span>
<span style="color: #FDECBC; font-weight: bold;">where</span>
    <span style="color: #ECBC9C;">Self</span>: <span style="color: #89C5C8;">Sized</span>,
<span style="color: #DCDCCC;">{</span>
    <span style="color: #ACD2AC;">/// Convert from Self to x7's Expr type.</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span>;
    <span style="color: #ACD2AC;">/// Convert x7's Expr type to Self.</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">from_x7</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">expr</span>: &amp;<span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This trait encodes a fallible forward-and-backward mapping between some foreign type and x7's <code>Expr</code> type.
If you're not familiar with <code>rust</code>, this adds methods to a type, and each operation
either results in a <code>Result</code>, which encodes a success path, and a failure path of type <code>Box&lt;dyn Error + Send&gt;</code>.
</p>

<p>
If the conversion fails for any reason, we try our best to type erase that error in terms
of <code>Box&lt;dyn Error + Send&gt;</code>. This error trait object helps a lot with wrangling different error types
into just one that we can reason about. That <code>Error</code> trait is the <code>std::error::Error</code> trait, which helps
interoperability between different rust programs. The <code>Send</code> trait bound is required as
our motivating example is <code>redis-oxide</code>, which requires that errors be sent between threads.
There's creates some unfortunate boilerplate around handling errors, but thankfully it's only around twenty lines.
</p>
</div>
