blog/2020-12-31/Adding-FFI-Support-In-x7.org
*** Example implementation of ForeignData

The last few paragraphs sound fancy, but we're really doing something simple here: converting between two different types. We'll have some foreign data type called =MyData=,
defined as a rust enum:

#+begin_src rust
  #[derive(Debug)]
  enum MyData {
      Int(u32),
      String(String),
  }
#+end_src

We'll also need a way to express errors as a =Box<dyn Error + Send>=, so we'll
add a basic =MyError= type with some boilerplate:

#+begin_src rust
  // A struct to hold the error string
  #[derive(Debug)]
  struct MyError(String);

  // Display is required for std::error::Error
  impl std::fmt::Display for MyError {
      fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
          write!(f, "Error: {}", self.0)
      }
  }

  // Actually implement std::Error::Error for MyError
  impl std::error::Error for MyError {}

  impl MyError {
      // An easy way to construct this error
      fn boxed(err: String) -> Box<dyn std::error::Error + Send> {
          Box::new(MyError(err))
      }
  }
#+end_src

This will help us return errors when someone for example tries to convert a x7 function
into a =MyData=.

Now that we have the boilerplate out of the way, we can implement =ForeignData= for =MyData=!

#+begin_src rust
  // Necessary imports
  use x7::ffi::{ExprHelper, ForeignData};
  use x7::symbols::Expr;

  // ForeignData implementation for MyData
  impl ForeignData for MyData {
      fn to_x7(&self) -> Result<Expr, Box<dyn std::error::Error + Send>> {
          // The forward direction is actually infallible
          let res = match self {
              MyData::Int(i) => Expr::Num((*i).into()),
              MyData::String(s) => Expr::String(s.clone()),
          };
          Ok(res)
      }

      fn from_x7(expr: &Expr) -> Result<Self, Box<dyn std::error::Error + Send>> {
          // The backward direction _is_ fallible.
          // e.g. There's no way to express x7 functions in terms of MyData
          let res = match expr {
              Expr::Num(i) => MyData::Int(i.to_u64()?), // to_u64 is a ExprHelper method
              Expr::String(s) => MyData::String(s.clone()),
              unknown_type => {
                  let err_msg = format!("{} cannot be converted to MyData", unknown_type);
                  return Err(MyError::boxed(err_msg));
              }
          };
          Ok(res)
      }
  }
#+end_src

Relatively speaking that's a lot of code for a simple conversion, but we can 
leverage the =ForeignData= trait to make some cool things for our FFI.

