blog/2020-12-31/Adding-FFI-Support-In-x7.html

<div id="outline-container-org379091f" class="outline-4">
<h4 id="org379091f">Example implementation of ForeignData</h4>
<div class="outline-text-4" id="text-org379091f">
<p>
The last few paragraphs sound fancy, but we're really doing something simple here: converting between two different types. We'll have some foreign data type called <code>MyData</code>,
defined as a rust enum:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Debug</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">MyData</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Int</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">u32</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">)</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We'll also need a way to express errors as a <code>Box&lt;dyn Error + Send&gt;</code>, so we'll
add a basic <code>MyError</code> type with some boilerplate:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">A struct to hold the error string</span>
<span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Debug</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">MyError</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">String</span><span style="color: #DCDCCC;">)</span>;

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Display is required for std::error::Error</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">fmt</span>::<span style="color: #89C5C8;">Display</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">MyError</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">fmt</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">f</span>: &amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">fmt</span>::<span style="color: #89C5C8;">Formatter</span><span style="color: #DDCC9C;">&lt;</span>'<span style="color: #ECBC9C;">_</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">fmt</span>::<span style="color: #89C5C8;">Result</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #DCDCCC; font-weight: bold;">write!</span><span style="color: #DDCC9C;">(</span>f, <span style="color: #D9A0A0;">"Error: </span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, <span style="color: #FDECBC; font-weight: bold;">self</span>.<span style="color: #CCF8CC;">0</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Actually implement std::Error::Error for MyError</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">error</span>::<span style="color: #89C5C8;">Error</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">MyError</span> <span style="color: #DCDCCC;">{}</span>

<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">MyError</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">An easy way to construct this error</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">boxed</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">err</span>: <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Box</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">error</span>::<span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Box</span>::new<span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">MyError</span><span style="color: #A0EDF0;">(</span>err<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This will help us return errors when someone for example tries to convert a x7 function
into a <code>MyData</code>.
</p>

<p>
Now that we have the boilerplate out of the way, we can implement <code>ForeignData</code> for <code>MyData</code>!
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Necessary imports</span>
<span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #CCF8CC;">x7</span>::<span style="color: #CCF8CC;">ffi</span>::<span style="color: #DCDCCC;">{</span><span style="color: #89C5C8;">ExprHelper</span>, <span style="color: #89C5C8;">ForeignData</span><span style="color: #DCDCCC;">}</span>;
<span style="color: #FDECBC; font-weight: bold;">use</span> <span style="color: #CCF8CC;">x7</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">Expr</span>;

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">ForeignData implementation for MyData</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">ForeignData</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">MyData</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">error</span>::<span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">The forward direction is actually infallible</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">res</span> = <span style="color: #FDECBC; font-weight: bold;">match</span> <span style="color: #FDECBC; font-weight: bold;">self</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #89C5C8;">MyData</span>::<span style="color: #89C5C8;">Int</span><span style="color: #A0EDF0;">(</span>i<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Num</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>*i<span style="color: #ACD2AC;">)</span>.into<span style="color: #ACD2AC;">()</span><span style="color: #A0EDF0;">)</span>,
            <span style="color: #89C5C8;">MyData</span>::<span style="color: #89C5C8;">String</span><span style="color: #A0EDF0;">(</span>s<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">String</span><span style="color: #A0EDF0;">(</span>s.clone<span style="color: #ACD2AC;">()</span><span style="color: #A0EDF0;">)</span>,
        <span style="color: #DDCC9C;">}</span>;
        <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span>res<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">from_x7</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">expr</span>: &amp;<span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">error</span>::<span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">The backward direction _is_ fallible.</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">e.g. There's no way to express x7 functions in terms of MyData</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">res</span> = <span style="color: #FDECBC; font-weight: bold;">match</span> expr <span style="color: #DDCC9C;">{</span>
            <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Num</span><span style="color: #A0EDF0;">(</span>i<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">MyData</span>::<span style="color: #89C5C8;">Int</span><span style="color: #A0EDF0;">(</span>i.to_u64<span style="color: #ACD2AC;">()</span><span style="color: #DCDCCC; font-weight: bold;">?</span><span style="color: #A0EDF0;">)</span>, <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">to_u64 is a ExprHelper method</span>
            <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">String</span><span style="color: #A0EDF0;">(</span>s<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">MyData</span>::<span style="color: #89C5C8;">String</span><span style="color: #A0EDF0;">(</span>s.clone<span style="color: #ACD2AC;">()</span><span style="color: #A0EDF0;">)</span>,
            unknown_type =&gt; <span style="color: #A0EDF0;">{</span>
                <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">err_msg</span> = <span style="color: #DCDCCC; font-weight: bold;">format!</span><span style="color: #ACD2AC;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;"> cannot be converted to MyData"</span>, unknown_type<span style="color: #ACD2AC;">)</span>;
                <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Err</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">MyError</span>::boxed<span style="color: #9CC7FB;">(</span>err_msg<span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>;
            <span style="color: #A0EDF0;">}</span>
        <span style="color: #DDCC9C;">}</span>;
        <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span>res<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Relatively speaking that's a lot of code for a simple conversion, but we can 
leverage the <code>ForeignData</code> trait to make some cool things for our FFI.
</p>
</div>
</div>
</div>
