blog/2020-12-31/Adding-FFI-Support-In-x7.org
** Implementing ForeignData for common types

To maximize convenience and skirt around rust's orphan rule, we'll provide ForeignData implementations
for common types like =String= and =u64=. There's a lot of these implementations in the =ffi.rs= file in x7.

#+begin_src rust
impl ForeignData for u64 {
    fn to_x7(&self) -> Result<Expr, Box<dyn Error + Send>> {
        Ok(Expr::Num((*self).into()))
    }

    fn from_x7(expr: &Expr) -> Result<Self, Box<dyn Error + Send>> {
        expr.to_u64()
    }
}
#+end_src

This will allow users to make functions using common rust types, and not worry about the details.

