blog/2020-12-31/Adding-FFI-Support-In-x7.html

<div id="outline-container-orgef9a258" class="outline-3">
<h3 id="orgef9a258">Implementing ForeignData for common types</h3>
<div class="outline-text-3" id="text-orgef9a258">
<p>
To maximize convenience and skirt around rust's orphan rule, we'll provide ForeignData implementations
for common types like <code>String</code> and <code>u64</code>. There's a lot of these implementations in the <code>ffi.rs</code> file in x7.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">ForeignData</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">u64</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Expr</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Num</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>*<span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #ACD2AC;">)</span>.into<span style="color: #ACD2AC;">()</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">from_x7</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">expr</span>: &amp;<span style="color: #89C5C8;">Expr</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        expr.to_u64<span style="color: #DDCC9C;">()</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This will allow users to make functions using common rust types, and not worry about the details.
</p>
</div>
</div>
