blog/2020-12-31/Adding-FFI-Support-In-x7.org
** Foreign Functions: The IntoX7Function Trait

Now that we can reason about foreign data, we want a way to convert functions written in terms
of foreign data types into something x7 can use. We'll use a technique known as extension traits to add a
=.to_x7_fn()= method to functions. We'll ignore variadic (any number of arguments) functions for
now, and only focus on functions with a known number of arguments.

The basic ingredients for a x7 function is:

1. A =X7FunctionPtr=, the pointer to the x7 function, which has some serious restrictions.
   1. The function has the shape =Fn(Vector<Expr>, &SymbolTable) -> LispResult<Expr>=.
   2. We require Sync + Send bounds to ensure thread safety (and make it compile).
2. A minimum number of arguments.
3. A symbol to represent the function (=my-ff=, etc).

We can use some trait magic to automate the first two, by having a trait that takes =self= and
and returns the minimum number of args, and the X7FunctionPtr:

#+begin_src rust
pub trait IntoX7Function<Args, Out> {
    fn to_x7_fn(self) -> (usize, crate::symbols::X7FunctionPtr);
}
#+end_src

An interesting part of this trait is the =<Args, Out>= types. We need those types to help differentiate our implementations
of =IntoX7Function=, and support variadics later on. The general implementation concept for a function that takes =n= arguments is:

1. Make an x7 function: =Fn(args: Vector<Expr>, _sym: &SymbolTable) -> LispResult<Expr>=
2. Verify that exactly =n= arguments are passed (=args.len()==n=).
3. Convert each x7 =Expr= argument to the type we need with =ForeignData::from_x7()=.
   1. Return a nice error message if that fails.
4. Call the foreign function with those now-converted arguments.
   1. Then capture and convert the function output with =Out::to_x7()= - x7 needs an =Expr=!
   2. Massage any errors into the error type x7 expects (=anyhow::Error=)

With that in mind, here's what the two argument implementation looks like without comments:

#+begin_src rust
impl<F, A, B, Out> IntoX7Function<(A, B), Out> for F
where
    A: ForeignData,
    B: ForeignData,
    Out: ForeignData,
    F: Fn(A, B) -> Out + Sync + Send + 'static,
{
    fn to_x7_fn(self) -> (usize, crate::symbols::X7FunctionPtr) {
        let f = move |args: Vector<Expr>, _sym: &SymbolTable| {
            crate::exact_len!(args, 2);
            let a = convert_arg!(A, &args[0]);
            let b = convert_arg!(B, &args[1]);
            (self)(a, b).to_x7().map_err(|e| anyhow!("{:?}", e))
        };
        (2, Arc::new(f))
    }
}
#+end_src

And here's what it looks like with comments:

#+begin_src rust
  // We're working with a function with two arguments,
  // that returns a single output type Out.
  impl<F, A, B, Out> IntoX7Function<(A, B), Out> for F
  where
      // All inputs and outputs to this function require ForeignData
      A: ForeignData,
      B: ForeignData,
      Out: ForeignData,
      // X7FunctionPtr requires Sync + Send, so we add that restriction to F
      F: Fn(A, B) -> Out + Sync + Send + 'static,
  {
      fn to_x7_fn(self) -> (usize, crate::symbols::X7FunctionPtr) {
          // This closure conforms to the shape X7FunctionPtr requires,
          // namely a function that takes a Vector<Expr> and a symbol table reference.
          //
          // args: (<ff-symbol> 1 2) -> vector![Expr::Num(1), Expr::Num(2)]; actual args passed
          // _sym: A symbol table reference. Unused.
          let f = move |args: Vector<Expr>, _sym: &SymbolTable| {
              // exact_len: macro to throw an error if args.len() != 2.
              crate::exact_len!(args, 2);
              // convert_arg: macro that calls A::from_x7(&args[0]) and return a nice error if that fails
              let a = convert_arg!(A, &args[0]);
              let b = convert_arg!(B, &args[1]);
              (self)(a, b) // (self)(a,b) calls the foreign function with args a, b
                  .to_x7() // convert the output to an x7 Expr
                  .map_err(|e| anyhow!("{:?}", e)) // massage error type to x7's error type (anyhow)
          };
          // Finally, return a tuple of minimum args + our function
          (2, Arc::new(f))
      }
  }
#+end_src

x7's FFI system contains similar implementations for functions that take one args to five args.
The appendix will cover variadic functions. All of this gives us the power to do:

#+begin_src rust
  let my_ff = |a: u64, b: u64| a + b; 
  let my_ff_x7 = my_ff.to_x7_fn();
#+end_src

Which is great, but now we need a way to make a x7 interpreter instance and actually add that =my_ff= function to it.

