blog/2020-12-31/Adding-FFI-Support-In-x7.html

<div id="outline-container-orgfabb7a6" class="outline-3">
<h3 id="orgfabb7a6">Foreign Functions: The IntoX7Function Trait</h3>
<div class="outline-text-3" id="text-orgfabb7a6">
<p>
Now that we can reason about foreign data, we want a way to convert functions written in terms
of foreign data types into something x7 can use. We'll use a technique known as extension traits to add a
<code>.to_x7_fn()</code> method to functions. We'll ignore variadic (any number of arguments) functions for
now, and only focus on functions with a known number of arguments.
</p>

<p>
The basic ingredients for a x7 function is:
</p>

<ol class="org-ol">
<li>A <code>X7FunctionPtr</code>, the pointer to the x7 function, which has some serious restrictions.
<ol class="org-ol">
<li>The function has the shape <code>Fn(Vector&lt;Expr&gt;, &amp;SymbolTable) -&gt; LispResult&lt;Expr&gt;</code>.</li>
<li>We require Sync + Send bounds to ensure thread safety (and make it compile).</li>
</ol></li>
<li>A minimum number of arguments.</li>
<li>A symbol to represent the function (<code>my-ff</code>, etc).</li>
</ol>

<p>
We can use some trait magic to automate the first two, by having a trait that takes <code>self</code> and
and returns the minimum number of args, and the X7FunctionPtr:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">IntoX7Function</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Args</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7_fn</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">X7FunctionPtr</span><span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
An interesting part of this trait is the <code>&lt;Args, Out&gt;</code> types. We need those types to help differentiate our implementations
of <code>IntoX7Function</code>, and support variadics later on. The general implementation concept for a function that takes <code>n</code> arguments is:
</p>

<ol class="org-ol">
<li>Make an x7 function: <code>Fn(args: Vector&lt;Expr&gt;, _sym: &amp;SymbolTable) -&gt; LispResult&lt;Expr&gt;</code></li>
<li>Verify that exactly <code>n</code> arguments are passed (<code>args.len()==n</code>).</li>
<li>Convert each x7 <code>Expr</code> argument to the type we need with <code>ForeignData::from_x7()</code>.
<ol class="org-ol">
<li>Return a nice error message if that fails.</li>
</ol></li>
<li>Call the foreign function with those now-converted arguments.
<ol class="org-ol">
<li>Then capture and convert the function output with <code>Out::to_x7()</code> - x7 needs an <code>Expr</code>!</li>
<li>Massage any errors into the error type x7 expects (<code>anyhow::Error</code>)</li>
</ol></li>
</ol>

<p>
With that in mind, here's what the two argument implementation looks like without comments:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">F</span>, <span style="color: #89C5C8;">A</span>, <span style="color: #89C5C8;">B</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">IntoX7Function</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">A</span>, <span style="color: #89C5C8;">B</span><span style="color: #CCF8CC;">)</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">F</span>
<span style="color: #FDECBC; font-weight: bold;">where</span>
    <span style="color: #ECBC9C;">A</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">B</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">Out</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">A</span>, <span style="color: #89C5C8;">B</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Out</span> + <span style="color: #89C5C8;">Sync</span> + <span style="color: #89C5C8;">Send</span> + '<span style="color: #FDECBC; font-weight: bold;">static</span>,
<span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7_fn</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">X7FunctionPtr</span><span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">f</span> = <span style="color: #FDECBC; font-weight: bold;">move</span> |<span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span>, <span style="color: #ECBC9C;">_sym</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span>| <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #9CC7FB;">exact_len!</span><span style="color: #A0EDF0;">(</span>args, <span style="color: #CCF8CC;">2</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">a</span> = <span style="color: #9CC7FB;">convert_arg!</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">A</span>, &amp;args<span style="color: #ACD2AC;">[</span><span style="color: #CCF8CC;">0</span><span style="color: #ACD2AC;">]</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">b</span> = <span style="color: #9CC7FB;">convert_arg!</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">B</span>, &amp;args<span style="color: #ACD2AC;">[</span><span style="color: #CCF8CC;">1</span><span style="color: #ACD2AC;">]</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #A0EDF0;">)(</span>a, b<span style="color: #A0EDF0;">)</span>.to_x7<span style="color: #A0EDF0;">()</span>.map_err<span style="color: #A0EDF0;">(</span>|e| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #ACD2AC;">(</span><span style="color: #D9A0A0;">"{:?}"</span>, e<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
        <span style="color: #DDCC9C;">}</span>;
        <span style="color: #DDCC9C;">(</span><span style="color: #CCF8CC;">2</span>, <span style="color: #89C5C8;">Arc</span>::new<span style="color: #A0EDF0;">(</span>f<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And here's what it looks like with comments:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We're working with a function with two arguments,</span>
<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">that returns a single output type Out.</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">F</span>, <span style="color: #89C5C8;">A</span>, <span style="color: #89C5C8;">B</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">IntoX7Function</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">A</span>, <span style="color: #89C5C8;">B</span><span style="color: #CCF8CC;">)</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">F</span>
<span style="color: #FDECBC; font-weight: bold;">where</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">All inputs and outputs to this function require ForeignData</span>
    <span style="color: #ECBC9C;">A</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">B</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">Out</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">X7FunctionPtr requires Sync + Send, so we add that restriction to F</span>
    <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">A</span>, <span style="color: #89C5C8;">B</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Out</span> + <span style="color: #89C5C8;">Sync</span> + <span style="color: #89C5C8;">Send</span> + '<span style="color: #FDECBC; font-weight: bold;">static</span>,
<span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7_fn</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">X7FunctionPtr</span><span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">This closure conforms to the shape X7FunctionPtr requires,</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">namely a function that takes a Vector&lt;Expr&gt; and a symbol table reference.</span>
        <span style="color: #6C8C6C;">//</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">args: (&lt;ff-symbol&gt; 1 2) -&gt; vector![Expr::Num(1), Expr::Num(2)]; actual args passed</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">_sym: A symbol table reference. Unused.</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">f</span> = <span style="color: #FDECBC; font-weight: bold;">move</span> |<span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span>, <span style="color: #ECBC9C;">_sym</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span>| <span style="color: #DDCC9C;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">exact_len: macro to throw an error if args.len() != 2.</span>
            <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #9CC7FB;">exact_len!</span><span style="color: #A0EDF0;">(</span>args, <span style="color: #CCF8CC;">2</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">convert_arg: macro that calls A::from_x7(&amp;args[0]) and return a nice error if that fails</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">a</span> = <span style="color: #9CC7FB;">convert_arg!</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">A</span>, &amp;args<span style="color: #ACD2AC;">[</span><span style="color: #CCF8CC;">0</span><span style="color: #ACD2AC;">]</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">b</span> = <span style="color: #9CC7FB;">convert_arg!</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">B</span>, &amp;args<span style="color: #ACD2AC;">[</span><span style="color: #CCF8CC;">1</span><span style="color: #ACD2AC;">]</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #A0EDF0;">)(</span>a, b<span style="color: #A0EDF0;">)</span> <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">(self)(a,b) calls the foreign function with args a, b</span>
                .to_x7<span style="color: #A0EDF0;">()</span> <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">convert the output to an x7 Expr</span>
                .map_err<span style="color: #A0EDF0;">(</span>|e| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #ACD2AC;">(</span><span style="color: #D9A0A0;">"{:?}"</span>, e<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span> <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">massage error type to x7's error type (anyhow)</span>
        <span style="color: #DDCC9C;">}</span>;
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Finally, return a tuple of minimum args + our function</span>
        <span style="color: #DDCC9C;">(</span><span style="color: #CCF8CC;">2</span>, <span style="color: #89C5C8;">Arc</span>::new<span style="color: #A0EDF0;">(</span>f<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
x7's FFI system contains similar implementations for functions that take one args to five args.
The appendix will cover variadic functions. All of this gives us the power to do:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">my_ff</span> = |<span style="color: #ECBC9C;">a</span>: <span style="color: #89C5C8;">u64</span>, <span style="color: #ECBC9C;">b</span>: <span style="color: #89C5C8;">u64</span>| a + b; 
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">my_ff_x7</span> = my_ff.to_x7_fn<span style="color: #DCDCCC;">()</span>;
</pre>
</div>

<p>
Which is great, but now we need a way to make a x7 interpreter instance and actually add that <code>my_ff</code> function to it.
</p>
</div>
</div>
