blog/2020-12-31/Adding-FFI-Support-In-x7.org
** The X7Interpreter

This part is thankfully much simpler than previous sections. We only need a struct holding a =SymbolTable= and a way to run programs on it.

#+begin_src rust
#[derive(Clone)]
pub struct X7Interpreter {
    symbol_table: SymbolTable,
}
#+end_src

And a way to make a new one:

#+begin_src rust
impl X7Interpreter {
    /// Make a new interpreter instance.
    pub fn new() -> Self {
        X7Interpreter {
            symbol_table: crate::stdlib::create_stdlib_symbol_table_no_cli(),
        }
    }
   // elided...
}
#+end_src

Finally, we need a way to run programs. We'll just take the program string as a =&str=, and call the usual lisp function of =read= and =eval=:

#+begin_src rust
  impl X7Interpreter {
      /// Run a x7 program.
      pub fn run_program<T: 'static + ForeignData>(
          &self,
          program: &str,
      ) -> Result<T, Box<dyn Error + Send>> {
          let mut last_expr = Expr::Nil;
          for expr in read(program) {
              last_expr = expr
                  .and_then(|expr| expr.eval(&self.symbol_table))
                  .map_err(ErrorBridge::new)?;
          }
          T::from_x7(&last_expr)
      }
  }
#+end_src

This function parses the input (=read=), and then for every expression in the program call =eval= and return errors as necessary.
We need to return something, so we default to =Expr::Nil= and return the last expression. The user needs to specify the output type =T=,
as we want to actually return something. It's now possible to do:

#+begin_src rust
  fn main() {
      let interpreter = X7Interpreter::new();
      let output = interpreter.run_program::<u64>("(+ 1 1)").unwrap();
      println!("output: {}", output);
      // prints "output: 2"
  }
#+end_src

Finally, we need a way to add functions to the interpreter. This is also straightforward thanks to =IntoX7Function=:

#+begin_src rust
  impl X7Interpreter {
      /// Add a function to the interpreter under the symbol `function_symbol`
      pub fn add_function(
          &self,
          function_symbol: &'static str,
          fn_tuple: (usize, crate::symbols::X7FunctionPtr),
      ) {
          let (minimum_args, fn_ptr) = fn_tuple;
          // The `true` at the end tells x7 to evaluate arguments passed in.
          let f = Function::new(function_symbol.into(), minimum_args, fn_ptr, true);
          self.symbol_table
              .add_symbol(function_symbol, Expr::Function(f));
      }
  }
#+end_src

All we're doing is making a new =Function= struct instance, and adding the function to the interpreter with under the symbol =function_symbol=.
Here's an example:

#+begin_src rust
fn main() {
    let interpreter = X7Interpreter::new();

    // Make and add the function to x7 under the symbol my-ff
    let my_ff = |a: u64, b: u64| a + b;
    interpreter.add_function("my-ff", my_ff.to_x7_fn());

    let output = interpreter.run_program::<u64>("(my-ff 1 1)").unwrap();
    println!("output: {}", output); // prints "output: 2"
}
#+end_src

Interestingly, we can also see our careful handling of errors has paid off. The following x7 program:

#+begin_src lisp
(my-ff 1 "i am a string")
#+end_src

Fails with this error message, as =my-ff= expects a =u64= not a string:

#+begin_example
Error in Fn<my-ff, 2, [ ]>, with args (1 "i am a string")

Caused by:
    Error: Expected num, but got type 'str': "i am a string"

    Caused by:
        BadTypes
#+end_example

