blog/2020-12-31/Adding-FFI-Support-In-x7.html

<div id="outline-container-org63ef521" class="outline-3">
<h3 id="org63ef521">The X7Interpreter</h3>
<div class="outline-text-3" id="text-org63ef521">
<p>
This part is thankfully much simpler than previous sections. We only need a struct holding a <code>SymbolTable</code> and a way to run programs on it.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Clone</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">X7Interpreter</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">symbol_table</span>: <span style="color: #89C5C8;">SymbolTable</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And a way to make a new one:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">X7Interpreter</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ACD2AC;">/// Make a new interpreter instance.</span>
    <span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">new</span><span style="color: #CCF8CC;">()</span> -&gt; <span style="color: #89C5C8;">Self</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">X7Interpreter</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #ECBC9C;">symbol_table</span>: <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">stdlib</span>::create_stdlib_symbol_table_no_cli<span style="color: #A0EDF0;">()</span>,
        <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
   <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">elided...</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Finally, we need a way to run programs. We'll just take the program string as a <code>&amp;str</code>, and call the usual lisp function of <code>read</code> and <code>eval</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">X7Interpreter</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ACD2AC;">/// Run a x7 program.</span>
    <span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">run_program</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #ECBC9C;">T</span>: '<span style="color: #FDECBC; font-weight: bold;">static</span> + <span style="color: #89C5C8;">ForeignData</span><span style="color: #CCF8CC;">&gt;(</span>
        &amp;<span style="color: #FDECBC; font-weight: bold;">self</span>,
        <span style="color: #ECBC9C;">program</span>: &amp;<span style="color: #89C5C8;">str</span>,
    <span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">T</span>, <span style="color: #89C5C8;">Box</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #FDECBC; font-weight: bold;">dyn</span> <span style="color: #89C5C8;">Error</span> + <span style="color: #89C5C8;">Send</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">last_expr</span> = <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Nil</span>;
        <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">expr</span> <span style="color: #FDECBC; font-weight: bold;">in</span> read<span style="color: #DDCC9C;">(</span>program<span style="color: #DDCC9C;">)</span> <span style="color: #DDCC9C;">{</span>
            last_expr = expr
                .and_then<span style="color: #A0EDF0;">(</span>|expr| expr.eval<span style="color: #ACD2AC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">self</span>.symbol_table<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
                .map_err<span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">ErrorBridge</span>::new<span style="color: #A0EDF0;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #89C5C8;">T</span>::from_x7<span style="color: #DDCC9C;">(</span>&amp;last_expr<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This function parses the input (<code>read</code>), and then for every expression in the program call <code>eval</code> and return errors as necessary.
We need to return something, so we default to <code>Expr::Nil</code> and return the last expression. The user needs to specify the output type <code>T</code>,
as we want to actually return something. It's now possible to do:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">interpreter</span> = <span style="color: #89C5C8;">X7Interpreter</span>::new<span style="color: #CCF8CC;">()</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">output</span> = interpreter.run_program::<span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">u64</span><span style="color: #CCF8CC;">&gt;(</span><span style="color: #D9A0A0;">"(+ 1 1)"</span><span style="color: #CCF8CC;">)</span>.unwrap<span style="color: #CCF8CC;">()</span>;
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"output: </span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, output<span style="color: #CCF8CC;">)</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">prints "output: 2"</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Finally, we need a way to add functions to the interpreter. This is also straightforward thanks to <code>IntoX7Function</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">X7Interpreter</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ACD2AC;">/// Add a function to the interpreter under the symbol `function_symbol`</span>
    <span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">add_function</span><span style="color: #CCF8CC;">(</span>
        &amp;<span style="color: #FDECBC; font-weight: bold;">self</span>,
        <span style="color: #ECBC9C;">function_symbol</span>: &amp;'<span style="color: #FDECBC; font-weight: bold;">static</span> <span style="color: #89C5C8;">str</span>,
        <span style="color: #ECBC9C;">fn_tuple</span>: <span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">X7FunctionPtr</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #DDCC9C;">(</span>minimum_args, fn_ptr<span style="color: #DDCC9C;">)</span> = fn_tuple;
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">The `true` at the end tells x7 to evaluate arguments passed in.</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">f</span> = <span style="color: #89C5C8;">Function</span>::new<span style="color: #DDCC9C;">(</span>function_symbol.into<span style="color: #A0EDF0;">()</span>, minimum_args, fn_ptr, <span style="color: #FDECBC; font-weight: bold;">true</span><span style="color: #DDCC9C;">)</span>;
        <span style="color: #FDECBC; font-weight: bold;">self</span>.symbol_table
            .add_symbol<span style="color: #DDCC9C;">(</span>function_symbol, <span style="color: #89C5C8;">Expr</span>::<span style="color: #89C5C8;">Function</span><span style="color: #A0EDF0;">(</span>f<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
All we're doing is making a new <code>Function</code> struct instance, and adding the function to the interpreter with under the symbol <code>function_symbol</code>.
Here's an example:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">interpreter</span> = <span style="color: #89C5C8;">X7Interpreter</span>::new<span style="color: #CCF8CC;">()</span>;

    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Make and add the function to x7 under the symbol my-ff</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">my_ff</span> = |<span style="color: #ECBC9C;">a</span>: <span style="color: #89C5C8;">u64</span>, <span style="color: #ECBC9C;">b</span>: <span style="color: #89C5C8;">u64</span>| a + b;
    interpreter.add_function<span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"my-ff"</span>, my_ff.to_x7_fn<span style="color: #DDCC9C;">()</span><span style="color: #CCF8CC;">)</span>;

    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">output</span> = interpreter.run_program::<span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">u64</span><span style="color: #CCF8CC;">&gt;(</span><span style="color: #D9A0A0;">"(my-ff 1 1)"</span><span style="color: #CCF8CC;">)</span>.unwrap<span style="color: #CCF8CC;">()</span>;
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"output: </span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, output<span style="color: #CCF8CC;">)</span>; <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">prints "output: 2"</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Interestingly, we can also see our careful handling of errors has paid off. The following x7 program:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>my-ff <span style="color: #CCF8CC;">1</span> <span style="color: #D9A0A0;">"i am a string"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Fails with this error message, as <code>my-ff</code> expects a <code>u64</code> not a string:
</p>

<pre class="example" id="orga9191b2">
Error in Fn&lt;my-ff, 2, [ ]&gt;, with args (1 "i am a string")

Caused by:
    Error: Expected num, but got type 'str': "i am a string"

    Caused by:
        BadTypes
</pre>
</div>
</div>
