blog/2020-12-31/Adding-FFI-Support-In-x7.org
** Conclusion

The x7 FFI system was very interesting for me to figure out, and this is what came out.
I hope you enjoyed the article - it's certainly more code and concept heavy than previous articles.

Overall I think there's some room for improvement in the FFI system, but it's powerful and convenient enough
to be embedded into =redis-oxide=, so I am content for now.

** Appendix: Variadics


Thanks to the signature of =IntoX7Function=, we can add a type =Variadic= and implement =IntoX7Function= in terms of it.

#+begin_src rust
  pub struct Variadic<T>(Vec<T>);

  impl<T> Variadic<T> {
      pub fn to_vec(self) -> Vec<T> {
          self.0
      }
  }
#+end_src

Note: The underlying =Vec<T>= forces us to use the single type for every variadic argument.
This isn't necessary a big deal, but it is something to keep in mind.

We now implement =IntoX7Function= in terms of =Variadic=:

#+begin_src rust
impl<F, T: ForeignData, Out> IntoX7Function<(Variadic<T>,), Out> for F
where
    T: ForeignData,
    Out: ForeignData,
    F: Fn(Variadic<T>) -> Out + Sync + Send + 'static,
{
    fn to_x7_fn(self) -> (usize, crate::symbols::X7FunctionPtr) {
        let f = move |args: Vector<Expr>, _sym: &SymbolTable| {
            let args = match args.iter().map(T::from_x7).collect::<Result<Vec<_>, _>>() {
                Ok(v) => v,
                Err(e) => return Err(anyhow!("{:?}", e)),
            };
            (self)(Variadic(args))
                .to_x7()
                .map_err(|e| anyhow!("{:?}", e))
        };
        (1, Arc::new(f))
    }
}
#+end_src

For interest, this is what using =Variadic= in redis-oxide looks like:

#+begin_src rust
  let send_fn = move |args: Variadic<RedisValueRef>| {
      let args = args.to_vec();
      // ... use args as a vec ...
      // ... implementation details coming in future article ..
  };
  self.interpreter.add_function("redis", send_fn.to_x7_fn());
#+end_src

This variadic FFI interface allows us to provide a _fully featured_ redis-oxide API in about 20 lines of code,
as commands are converted directly into the internal representation for command processing:

#+begin_src lisp
  ;; No special API code! Directly converted and passed to the command processor
  (redis "mset" "key1" "value1" "key2" "value2")
  (redis "lpush" "list-key" "value1" "value2")
#+end_src
