blog/2020-12-31/Adding-FFI-Support-In-x7.html

<div id="outline-container-org72dbe0d" class="outline-3">
<h3 id="org72dbe0d">Conclusion</h3>
<div class="outline-text-3" id="text-org72dbe0d">
<p>
The x7 FFI system was very interesting for me to figure out, and this is what came out.
I hope you enjoyed the article - it's certainly more code and concept heavy than previous articles.
</p>

<p>
Overall I think there's some room for improvement in the FFI system, but it's powerful and convenient enough
to be embedded into <code>redis-oxide</code>, so I am content for now.
</p>
</div>
</div>

<div id="outline-container-orgf5709db" class="outline-3">
<h3 id="orgf5709db">Appendix: Variadics</h3>
<div class="outline-text-3" id="text-orgf5709db">
<p>
Thanks to the signature of <code>IntoX7Function</code>, we can add a type <code>Variadic</code> and implement <code>IntoX7Function</code> in terms of it.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">Variadic</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #DCDCCC;">&gt;(</span><span style="color: #89C5C8;">Vec</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #CCF8CC;">&gt;</span><span style="color: #DCDCCC;">)</span>;

<span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Variadic</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_vec</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Vec</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">self</span>.<span style="color: #CCF8CC;">0</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Note: The underlying <code>Vec&lt;T&gt;</code> forces us to use the single type for every variadic argument.
This isn't necessary a big deal, but it is something to keep in mind.
</p>

<p>
We now implement <code>IntoX7Function</code> in terms of <code>Variadic</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">F</span>, <span style="color: #ECBC9C;">T</span>: <span style="color: #89C5C8;">ForeignData</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">IntoX7Function</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Variadic</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #DDCC9C;">&gt;</span>,<span style="color: #CCF8CC;">)</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">F</span>
<span style="color: #FDECBC; font-weight: bold;">where</span>
    <span style="color: #ECBC9C;">T</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">Out</span>: <span style="color: #89C5C8;">ForeignData</span>,
    <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">Variadic</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">T</span><span style="color: #CCF8CC;">&gt;</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Out</span> + <span style="color: #89C5C8;">Sync</span> + <span style="color: #89C5C8;">Send</span> + '<span style="color: #FDECBC; font-weight: bold;">static</span>,
<span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">to_x7_fn</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #FDECBC; font-weight: bold;">crate</span>::<span style="color: #CCF8CC;">symbols</span>::<span style="color: #89C5C8;">X7FunctionPtr</span><span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">f</span> = <span style="color: #FDECBC; font-weight: bold;">move</span> |<span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Vector</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Expr</span><span style="color: #DDCC9C;">&gt;</span>, <span style="color: #ECBC9C;">_sym</span>: &amp;<span style="color: #89C5C8;">SymbolTable</span>| <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">args</span> = <span style="color: #FDECBC; font-weight: bold;">match</span> args.iter<span style="color: #A0EDF0;">()</span>.map<span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">T</span>::from_x7<span style="color: #A0EDF0;">)</span>.collect::<span style="color: #A0EDF0;">&lt;</span><span style="color: #89C5C8;">Result</span><span style="color: #ACD2AC;">&lt;</span><span style="color: #89C5C8;">Vec</span><span style="color: #9CC7FB;">&lt;</span>_<span style="color: #9CC7FB;">&gt;</span>, _<span style="color: #ACD2AC;">&gt;</span><span style="color: #A0EDF0;">&gt;()</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #89C5C8;">Ok</span><span style="color: #ACD2AC;">(</span>v<span style="color: #ACD2AC;">)</span> =&gt; v,
                <span style="color: #89C5C8;">Err</span><span style="color: #ACD2AC;">(</span>e<span style="color: #ACD2AC;">)</span> =&gt; <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Err</span><span style="color: #ACD2AC;">(</span><span style="color: #9CC7FB;">anyhow!</span><span style="color: #9CC7FB;">(</span><span style="color: #D9A0A0;">"{:?}"</span>, e<span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>,
            <span style="color: #A0EDF0;">}</span>;
            <span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #A0EDF0;">)(</span><span style="color: #89C5C8;">Variadic</span><span style="color: #ACD2AC;">(</span>args<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
                .to_x7<span style="color: #A0EDF0;">()</span>
                .map_err<span style="color: #A0EDF0;">(</span>|e| <span style="color: #9CC7FB;">anyhow!</span><span style="color: #ACD2AC;">(</span><span style="color: #D9A0A0;">"{:?}"</span>, e<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
        <span style="color: #DDCC9C;">}</span>;
        <span style="color: #DDCC9C;">(</span><span style="color: #CCF8CC;">1</span>, <span style="color: #89C5C8;">Arc</span>::new<span style="color: #A0EDF0;">(</span>f<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
For interest, this is what using <code>Variadic</code> in redis-oxide looks like:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">send_fn</span> = <span style="color: #FDECBC; font-weight: bold;">move</span> |<span style="color: #ECBC9C;">args</span>: <span style="color: #89C5C8;">Variadic</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">RedisValueRef</span><span style="color: #DCDCCC;">&gt;</span>| <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">args</span> = args.to_vec<span style="color: #CCF8CC;">()</span>;
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... use args as a vec ...</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... implementation details coming in future article ..</span>
<span style="color: #DCDCCC;">}</span>;
<span style="color: #FDECBC; font-weight: bold;">self</span>.interpreter.add_function<span style="color: #DCDCCC;">(</span><span style="color: #D9A0A0;">"redis"</span>, send_fn.to_x7_fn<span style="color: #CCF8CC;">()</span><span style="color: #DCDCCC;">)</span>;
</pre>
</div>

<p>
This variadic FFI interface allows us to provide a <span class="underline">fully featured</span> redis-oxide API in about 20 lines of code,
as commands are converted directly into the internal representation for command processing:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #6C8C6C;">;; </span><span style="color: #8CAC8C;">No special API code! Directly converted and passed to the command processor</span>
<span style="color: #DCDCCC;">(</span>redis <span style="color: #D9A0A0;">"mset"</span> <span style="color: #D9A0A0;">"key1"</span> <span style="color: #D9A0A0;">"value1"</span> <span style="color: #D9A0A0;">"key2"</span> <span style="color: #D9A0A0;">"value2"</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>redis <span style="color: #D9A0A0;">"lpush"</span> <span style="color: #D9A0A0;">"list-key"</span> <span style="color: #D9A0A0;">"value1"</span> <span style="color: #D9A0A0;">"value2"</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Briggs</p>
<p class="date">Created: 2021-01-01 Fri 17:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
